<?php
/**
 * Created by PhpStorm.
 * User: Yurij
 * Date: 18.01.2018
 * Time: 17:13
 */
// TODO категоризировать тесты
return [
    //Проверки корректности выдачи ошибки и предусмотрены ли ошибки если данные не верны
    [
        'number' => 5,
        'set'    => [], //Проверка кейса когда массив пуст
        'result' => -1,
    ],
    [
        'number' => 5,
        'set'    => ['5',1], // проверка на то, что используется строгое равенство по типам
        'result' => -1,
    ],
    [
        'number' => 5,
        'set'    => [1],
        'result' => -1,
    ],
    [
        'number' => 5,
        'set'    => [5],
        'result' => -1,
    ],
    [
        'number' => 5,
        'set'    => [1, 1], //проверка кейса когда заданного числа вообще нет в массиве
        'result' => -1,
    ],
    [
        'number' => 5,
        'set'    => [5, 5, 5, 5],
        'result' => -1,
    ],
    [
        'number' => 5,
        'set'    => [5, 5, 5, 1],
        'result' => 1,
    ],
    [
        'number' => 5,
        'set'    => [1, 5, 5, 5],
        'result' => -1,
    ],
    [
        'number' => 1,
        'set'    => [0, 1, 1, 1],
        'result' => -1,
    ],
    [
        'number' => 1,
        'set'    => [0, 0, 1, 1],
        'result' => -1,
    ],
    [
        'number' => 1,
        'set'    => [1, 0, 1, 'abc'], //Проверка не верных входных данных
        'result' => -1,
    ],

    //Проверки работы алгоритма с отрицательными числами
    [
        'number' => 1,
        'set'    => [0, 0, -1, -1],
        'result' => -1,
    ],
    [
        'number' => -5,
        'set'    => [-5, -5, 1, 7, 2, 3, -5],
        'result' => 4,
    ],
    [
        'number' => -5,
        'set'    => [-5, -5, 1, 7, 2, 3, -5, 4, -5, -5, 6],
        'result' => 6,
    ],
    [
        'number' => 5,
        'set'    => [5, 5, -1, -7, 2, 3, 5, -4, 5, 5, 6],
        'result' => 6,
    ],
    //Обычные проверки алгоритма
    [
        'number' => 5,
        'set'    => [5, 5, 1, 7, 2, 3, 5],
        'result' => 4,
    ],
    [
        'number' => 5,
        'set'    => [5, 5, 1, 7, 2, 3, 5, 4, 5, 5, 6],
        'result' => 6,
    ],

    [
        'number' => 0,
        'set'    => [0, 0, 1, 1],
        'result' => 2,
    ],
    [
        'number' => 1,
        'set'    => [3, 3, 5, 3, 4, 1, 1, 2, 4, 2, 4, 4],
        'result' => 10,
    ],
];